/*
1. Сделать из строки "я каКая-То кРиваЯ стрОка" - "Я какая-то кривая строка" и вывести в консоль
2. Получить от пользователя через prompt информацию о его имени, возрасте и росте и вывести в консоль в таком виде:
Ваше имя - Имя
ваш возраст - Возраст
ваш рост - Рост
3. Создать массив и заполнить его значениями деревьев. Вывести в консоль эти значения через запятую в одну строку - "Дуб, Клен, Береза, Осина"
4. Создать строку str = "он идет домой", разбить ее в массив на 3 части(слова) и вывести в консоль все слова так, чтобы каждое начиналось с большой буквы - Он Идет Домой
*/