
// const ratmir = {
//     name:'Ратмир',
//     age: 11,
//     address: ['Москва', 'Каспийская', 28, 4, 31],
//     "номер комнаты": 2, 
// }
// const vasyi = {
//     name:'Вася',
//     age: 54,
//     address: ['Кисловодск', 'Каринарная', 5, 7, 11],
//     "номер комнаты": 3, 
// }
// const petyi = {
//     name:'петя',
//     age: 5,
//     address: ['Симферопль', 'Кортенская', 12, 7, 57],
//     "номер комнаты": 6, 
// }
// const dima = {
//     name:'Дима',
//     age: 42,
//     address: ['Краснодар', 'Ахтинская', 46, 7, 81],
//     "номер комнаты": 7, 
// }
// const vanyi = {
//     name:'Ваня',
//     age: 16,
//     address: ['Воронеж', 'Ивановский проспект', 4, 6, 38],
//     "номер комнаты": 4, 
// }

// const array = [ratmir, vanyi, vasyi, dima, petyi]
// console.log(array)

const array = [
  {
    name: 'Ратмир',
    age: 11,
    address: [ 'Москва', 'Каспийская', 28, 4, 31 ],
    'номер комнаты': 2
  },
  {
    name: 'Ваня',
    age: 16,
    address: [ 'Воронеж', 'Ивановский проспект', 4, 6, 38 ],
    'номер комнаты': 4
  },
  {
    name: 'Вася',
    age: 54,
    address: [ 'Кисловодск', 'Каринарная', 5, 7, 11 ],
    'номер комнаты': 3
  },
  {
    name: 'Дима',
    age: 42,
    address: [ 'Краснодар', 'Ахтинская', 46, 7, 81 ],
    'номер комнаты': 7
  },
  {
    name: 'петя',
    age: 5,
    address: [ 'Симферопль', 'Кортенская', 12, 7, 57 ],
    'номер комнаты': 6
  }
]

array.push(
    {
        name: 'какашка',
        age: 5,
        address: ['Яркутск', 'Паловниковый проспект', 23, 4, 58],
        'номер комнаты': 4,
    }
)

console.log(array[3]["номер комнаты"])
console.log(array[4].address[0])
console.log(array)
