/*
1. Сделать из строки "я каКая-То кРиваЯ стрОка" - "Я какая-то кривая строка" и вывести в консоль
2. Получить от пользователя через prompt информацию о его имени, возрасте и росте и вывести в консоль в таком виде:
Ваше имя - Имя
ваш возраст - Возраст
ваш рост - Рост
3. Создать массив и заполнить его значениями деревьев. Вывести в консоль эти значения через запятую в одну строку - "Дуб, Клен, Береза, Осина"
4. Создать строку str = "он идет домой", разбить ее в массив на 3 части(слова) и вывести в консоль все слова так, чтобы каждое начиналось с большой буквы - Он Идет Домой.
Решение должно быть универсальным, работать для любой строки из 3 слов.
5. Создать случайное число, умножить его на 3 и округлить до целого в нижнюю сторону.
6. Создать строку let str = "говядина" и выводить случайную букву в консоль при каждом обновлении
7.Напиши программу, которая: 
    Спрашивает: "Стрелять из пушки? (да/нет)" → через prompt или confirm
    Если ответ "да":
    Генерируется случайное число (от 1 до 10)
    Если число больше 5 → выводится: "Попадание! Вы убили противника."
    Иначе → "Промах! Враг стреляет и убивает вас."
    Если ответ "нет":
    Выводится: "Вы решили уйти в укрытие.Вас заметили и убили."
    В конце показывается сообщение: "Бой окончен." через alert
*/