/*
1.1 Сделать из строки "я каКая-То кРиваЯ стрОка" - "Я какая-то кривая строка" и вывести в консоль
1.2. Получить от пользователя через prompt информацию о его имени, возрасте и росте и вывести в консоль в таком виде:
Ваше имя - Имя
ваш возраст - Возраст
ваш рост - Рост
1.3. Создать массив и заполнить его значениями деревьев. Вывести в консоль эти значения через запятую в одну строку - "Дуб, Клен, Береза, Осина"
1.4. Создать строку str = "он идет домой", разбить ее в массив на 3 части(слова) и вывести в консоль все слова так, чтобы каждое начиналось с большой буквы - Он Идет Домой.
Решение должно быть универсальным, работать для любой строки из 3 слов.
1.5. Создать случайное число, умножить его на 3 и округлить до целого в нижнюю сторону.
1.6. Создать строку let str = "говядина" и выводить случайную букву в консоль при каждом обновлении
2.1.Напиши программу, которая: 
    Спрашивает: "Стрелять из пушки? (да/нет)" → через prompt или confirm
    Если ответ "да":
    Генерируется случайное число (от 1 до 10)
    Если число больше 5 → выводится: "Попадание! Вы убили противника."
    Иначе → "Промах! Враг стреляет и убивает вас."
    Если ответ "нет":
    Выводится: "Вы решили уйти в укрытие.Вас заметили и убили."
    В конце показывается сообщение: "Бой окончен." через alert
*/
2.3; /*Напишите программу, которая выводит в консоль обратный отсчёт от 10 до 1, используя цикл. 
После окончания отсчёта должно появиться сообщение "Пуск!".
Вывод
10
9
8
...
1
Пуск!
// */

2.4; /* Фильтрация массива
Дан массив чисел:
let numbers = [3, 7, -2, 10, -5, 0, 8];
С помощью цикла создайте новый массив positives, который будет содержать только положительные числа из исходного массива.
*/
2.5; /* Фильтрация массива 2
Дан массив чисел:
const numbers = [32, 72, -2, 10, -52, 0, 80];
Нужно с помощью цикла отфильтровать из массива numbers числа > 10, после чего умножить их на 5 и сложить в новый массив result
*/

2.6;
/*С помощью вложенных циклов выведите квадрат 4х4 из *
Можно использовать только одну *, количество которых должно увеличиваться с помощью цикла
Результат в консоли должен выглядеть:

****
**** 
****
****

*/
2.7; /*
Напишите простую игру "Угадай число". Программа "загадывает" случайное число от 1 до 10. 
Пользователь пытается его угадать, вводя число через prompt. Если он угадал — выводится сообщение Вы угадали!.

Пример:
Угадайте число от 1 до 10
Введите число: 5 ( а загаданное число меньше 5)
Меньше
Введите число: 3 (а загаданное больше 3 , т.е - 4)
Больше
Введите число: 4
Вы угадали!

2.8
вывести в консоль элемент со значением 'кухня'
const dima = ['Дима', 4, ['Москва', 'Каспийская', 28, 4, 31, [1,2,3,'кухня']]]

console.log(person[2][6])
easy
2.9
ЗАписать все элементы массива в переменные через десруктуризацию
const array = ['Олени', 'папа какашка', 'ты балбес']
SUPER SUPER PUPER PUPER EASY
*/